프로젝트명: 타이타닉 분석
# 1. 데이터 input / output

In [13]:
import pandas as pd
data = pd.read_csv('~/Desktop/ADP/pandas실습/Titanic-Dataset.csv')

In [18]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [19]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [20]:
data[-10:][['Cabin', 'Embarked']]

    Cabin Embarked
881   NaN        S
882   NaN        S
883   NaN        S
884   NaN        S
885   NaN        Q
886   NaN        S
887   B42        S
888   NaN        S
889  C148        C
890   NaN        Q

In [21]:
data.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass                                               Name     Sex   Age  SibSp  Parch  \
0              1         0       3                            Braund, Mr. Owen Harris    male  22.0      1      0
1              2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1      0
2              3         1       3                             Heikkinen, Miss. Laina  female  26.0      0      0
3              4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0
4              5         0       3                           Allen, Mr. William Henry    male  35.0      0      0
..           ...       ...     ...                                                ...     ...   ...    ...    ...
886          887         0       2                              Montvila, Rev. Juozas    male  27.0      0      0
887          888         1       1                       Graham, Miss. Margaret Edith  female  19.0      0      0
888          889         0       3           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1      2
889          890         1       1                              Behr, Mr. Karl Howell    male  26.0      0      0
890          891         0       3                                Dooley, Mr. Patrick    male  32.0      0      0

               Ticket    Fare Cabin Embarked
0           A/5 21171   7.250   NaN        S
1            PC 17599  71.283   C85        C
2    STON/O2. 3101282   7.925   NaN        S
3              113803  53.100  C123        S
4              373450   8.050   NaN        S
..                ...     ...   ...      ...
886            211536  13.000   NaN        S
887            112053  30.000   B42        S
888        W./C. 6607  23.450   NaN        S
889            111369  30.000  C148        C
890            370376   7.750   NaN        Q

[891 rows x 12 columns]>

In [22]:
data.describe

<bound method NDFrame.describe of      PassengerId  Survived  Pclass                                               Name     Sex   Age  SibSp  Parch  \
0              1         0       3                            Braund, Mr. Owen Harris    male  22.0      1      0
1              2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1      0
2              3         1       3                             Heikkinen, Miss. Laina  female  26.0      0      0
3              4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0
4              5         0       3                           Allen, Mr. William Henry    male  35.0      0      0
..           ...       ...     ...                                                ...     ...   ...    ...    ...
886          887         0       2                              Montvila, Rev. Juozas    male  27.0      0      0
887          888         1       1                       Graham, Miss. Margaret Edith  female  19.0      0      0
888          889         0       3           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1      2
889          890         1       1                              Behr, Mr. Karl Howell    male  26.0      0      0
890          891         0       3                                Dooley, Mr. Patrick    male  32.0      0      0

               Ticket    Fare Cabin Embarked
0           A/5 21171   7.250   NaN        S
1            PC 17599  71.283   C85        C
2    STON/O2. 3101282   7.925   NaN        S
3              113803  53.100  C123        S
4              373450   8.050   NaN        S
..                ...     ...   ...      ...
886            211536  13.000   NaN        S
887            112053  30.000   B42        S
888        W./C. 6607  23.450   NaN        S
889            111369  30.000  C148        C
890            370376   7.750   NaN        Q

[891 rows x 12 columns]>

In [23]:
data.describe()

       PassengerId  Survived   Pclass      Age    SibSp    Parch     Fare
count      891.000   891.000  891.000  714.000  891.000  891.000  891.000
mean       446.000     0.384    2.309   29.699    0.523    0.382   32.204
std        257.354     0.487    0.836   14.526    1.103    0.806   49.693
min          1.000     0.000    1.000    0.420    0.000    0.000    0.000
25%        223.500     0.000    2.000   20.125    0.000    0.000    7.910
50%        446.000     0.000    3.000   28.000    0.000    0.000   14.454
75%        668.500     1.000    3.000   38.000    1.000    0.000   31.000
max        891.000     1.000    3.000   80.000    8.000    6.000  512.329

2. 결측치

In [28]:
data.isnull().sum() / len(data) *100

PassengerId     0.000
Survived        0.000
Pclass          0.000
Name            0.000
Sex             0.000
Age            19.865
SibSp           0.000
Parch           0.000
Ticket          0.000
Fare            0.000
Cabin          77.104
Embarked        0.224
dtype: float64

In [29]:
data.isnull().mean() * 100

PassengerId     0.000
Survived        0.000
Pclass          0.000
Name            0.000
Sex             0.000
Age            19.865
SibSp           0.000
Parch           0.000
Ticket          0.000
Fare            0.000
Cabin          77.104
Embarked        0.224
dtype: float64

In [31]:
data[~data['Cabin'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.862,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.550,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.554,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.158,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C

In [33]:
data.dropna(subset=['Age', 'Cabin'], inplace=True)

In [34]:
data.shape

(185, 12)

In [39]:
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [12]:
data.shape

NameError: name 'data' is not defined

In [41]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.862,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.550,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.554,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.158,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C

# 3. 중복값

In [ ]:
# 상황 1: A: 166cm, B:166cm
# 상황 1: A: 166cm, A:166cm
# 상황 1: A: 166cm, A:168cm

In [42]:
len(data)

185

In [53]:
data["PassengerId"].unique()

array([  2,   4,   7,  11,  12,  22,  24,  28,  53,  55,  62,  63,  67,
        76,  89,  93,  97,  98, 103, 111, 119, 124, 125, 137, 138, 140,
       149, 152, 171, 175, 178, 184, 194, 195, 196, 206, 210, 216, 219,
       225, 231, 246, 249, 252, 253, 258, 263, 264, 269, 270, 274, 276,
       292, 293, 298, 300, 306, 308, 310, 311, 312, 319, 320, 326, 328,
       330, 332, 333, 337, 338, 340, 341, 342, 346, 357, 367, 370, 371,
       378, 391, 394, 395, 413, 430, 431, 435, 436, 439, 446, 450, 453,
       454, 457, 461, 463, 474, 485, 487, 488, 493, 497, 499, 505, 506,
       513, 516, 517, 521, 524, 537, 540, 541, 545, 551, 557, 559, 572,
       573, 578, 582, 584, 586, 588, 592, 600, 610, 619, 622, 626, 628,
       631, 633, 642, 646, 648, 660, 663, 672, 680, 682, 690, 691, 699,
       700, 701, 702, 708, 711, 713, 716, 717, 718, 725, 731, 738, 742,
       743, 746, 749, 752, 760, 764, 766, 773, 780, 782, 783, 790, 797,
       803, 807, 810, 821, 824, 830, 836, 854, 858, 863, 868, 872, 873,
       880, 888, 890])

In [56]:
df_ex = pd.DataFrame({"Id": ["A", "A", "A", "B", "B", "C"],
              "키": [166, 166, 150, 166, 170, 180]})
df_ex

  Id    키
0  A  166
1  A  166
2  A  150
3  B  166
4  B  170
5  C  180

In [58]:
df_ex.drop_duplicates("Id")

  Id    키
0  A  166
3  B  166
5  C  180

In [59]:
df_ex.drop_duplicates("Id", keep="last")

  Id    키
2  A  150
4  B  170
5  C  180

In [60]:
df_ex.sort_values("키", ascending=True)

  Id    키
2  A  150
0  A  166
1  A  166
3  B  166
4  B  170
5  C  180

In [62]:
df_ex.sort_values("키", ascending=True).reset_index(drop=True)

  Id    키
0  A  150
1  A  166
2  A  166
3  B  166
4  B  170
5  C  180

In [65]:
df_ex.sort_values("키", ascending=True).drop_duplicates("Id",keep="last")

  Id    키
1  A  166
4  B  170
5  C  180

In [5]:
df_ex = pd.DataFrame({"Id": ["A", "A", "A", "B", "B", "C"],
        "키": [166, 166, 150, 166, 170, 180],
        "날짜": [202206, 202205, 202102, 202201, 202206, 202206]})
df_ex

  Id    키      날짜
0  A  166  202206
1  A  166  202205
2  A  150  202102
3  B  166  202201
4  B  170  202206
5  C  180  202206

In [68]:
df_ex.sort_values("키", ascending=True).drop_duplicates("Id",keep="last")

  Id    키      날짜
1  A  166  202205
4  B  170  202206
5  C  180  202206

4. 날짜/시간

In [69]:
df_ex.sort_values("날짜", ascending=True).drop_duplicates("Id",keep="last")

  Id    키      날짜
0  A  166  202206
4  B  170  202206
5  C  180  202206

In [6]:
df_ex

  Id    키      날짜
0  A  166  202206
1  A  166  202205
2  A  150  202102
3  B  166  202201
4  B  170  202206
5  C  180  202206

In [ ]:
#날짜 관련한 열이 없다. - 왜 없지? 없어도 될까? 그럼 데이터는 언제 만들어졌지?
#날짜 관련한 열이 하나 있다. - 이 데이터가 행에 해당하는 날짜일까?
                         #데이터베이스 - 자동으로 생성된 그런 생성날짜인지
                         #식별키에 해당하는 날짜인지..
#날짜 관련한 열이 많이 있다

In [7]:
df_ex["날짜_수정"] = pd.to_datetime(df_ex["날짜"], format='%Y%m')
df_ex[["날짜", "날짜_수정"]]

       날짜      날짜_수정
0  202206 2022-06-01
1  202205 2022-05-01
2  202102 2021-02-01
3  202201 2022-01-01
4  202206 2022-06-01
5  202206 2022-06-01

In [8]:
df_ex.info

<bound method DataFrame.info of   Id    키      날짜      날짜_수정
0  A  166  202206 2022-06-01
1  A  166  202205 2022-05-01
2  A  150  202102 2021-02-01
3  B  166  202201 2022-01-01
4  B  170  202206 2022-06-01
5  C  180  202206 2022-06-01>

In [9]:
df_ex[df_ex["날짜_수정"] > '2022-01-01']

  Id    키      날짜      날짜_수정
0  A  166  202206 2022-06-01
1  A  166  202205 2022-05-01
4  B  170  202206 2022-06-01
5  C  180  202206 2022-06-01

5.계산하기

In [14]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [15]:
data.describe()

       PassengerId  Survived   Pclass      Age    SibSp    Parch     Fare
count      891.000   891.000  891.000  714.000  891.000  891.000  891.000
mean       446.000     0.384    2.309   29.699    0.523    0.382   32.204
std        257.354     0.487    0.836   14.526    1.103    0.806   49.693
min          1.000     0.000    1.000    0.420    0.000    0.000    0.000
25%        223.500     0.000    2.000   20.125    0.000    0.000    7.910
50%        446.000     0.000    3.000   28.000    0.000    0.000   14.454
75%        668.500     1.000    3.000   38.000    1.000    0.000   31.000
max        891.000     1.000    3.000   80.000    8.000    6.000  512.329

In [17]:
print('PassengerId:', data["PassengerId"].nunique())
print('Age', data["Age"].nunique())

PassengerId: 891
Age 88

In [21]:
data["Ticket"].value_counts()

Ticket
347082              7
1601                7
CA. 2343            7
3101295             6
CA 2144             6
                   ..
PC 17590            1
17463               1
330877              1
373450              1
STON/O2. 3101282    1
Name: count, Length: 681, dtype: int64

In [22]:
data.groupby('Ticket')['Survived'].mean()

Ticket
110152         1.000
110413         0.667
110465         0.000
110564         1.000
110813         1.000
               ...
W./C. 6608     0.000
W./C. 6609     0.000
W.E.P. 5734    0.000
W/C 14208      0.000
WE/P 5735      0.500
Name: Survived, Length: 681, dtype: float64

In [23]:
data["Ticket_mean"] = data.groupby("Ticket")['Survived'].transform('mean')

In [24]:
data[["Ticket_mean", "Ticket"]]

     Ticket_mean            Ticket
0            0.0         A/5 21171
1            1.0          PC 17599
2            1.0  STON/O2. 3101282
3            0.5            113803
4            0.0            373450
..           ...               ...
886          0.0            211536
887          1.0            112053
888          0.0        W./C. 6607
889          1.0            111369
890          0.0            370376

[891 rows x 2 columns]

In [ ]:
[1, 2, 3, 4, 100, 120]

[1, 2, 3, ------ 4, 100, 120]
[1, 2, 3, 4, ------- 100, 120]

In [25]:
pd.qcut([1, 2, 3, 4, 100, 120], 2).value_counts()

(0.999, 3.5]    3
(3.5, 120.0]    3
Name: count, dtype: int64

In [26]:
pd.cut([1, 2, 3, 4, 100, 120], 2).value_counts()

(0.881, 60.5]    4
(60.5, 120.0]    2
Name: count, dtype: int64

In [27]:
pd.cut([1, 2, 3, 4, 100, 120], 2, labels = ["A", "B"])

['A', 'A', 'A', 'A', 'B', 'B']
Categories (2, object): ['A' < 'B']

In [28]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Ticket_mean
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S,0.5
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S,0.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C,1.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q,0.0

In [33]:
data["Fare_group"] = pd.qcut(data["Fare"], 3,
                             labels = ["L", "M","H"])

In [35]:
data[["PassengerId", "Fare", "Fare_group"]]

     PassengerId    Fare Fare_group
0              1   7.250          L
1              2  71.283          H
2              3   7.925          L
3              4  53.100          H
4              5   8.050          L
..           ...     ...        ...
886          887  13.000          M
887          888  30.000          H
888          889  23.450          M
889          890  30.000          H
890          891   7.750          L

[891 rows x 3 columns]

In [51]:
data["Fare_level"] = data.groupby("PassengerId")["Fare_group"].\
    transform(lambda x: pd.qcut(x.astype(float), 3, labels=["L", "M", "H"], duplicates="drop").astype(str))

ValueError: Cannot cast object dtype to float64